-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.3.10-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 테이블 pythondb.tbl_oil 구조 내보내기
CREATE TABLE IF NOT EXISTS `tbl_oil` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `area` varchar(50) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `addr` varchar(50) DEFAULT NULL,
  `brand` varchar(50) DEFAULT NULL,
  `tel` varchar(50) DEFAULT NULL,
  `self` varchar(50) DEFAULT NULL,
  `gas_p` varchar(50) DEFAULT NULL,
  `gas` int(11) DEFAULT NULL,
  `gas_l` varchar(50) DEFAULT NULL,
  `gas_d` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=48 DEFAULT CHARSET=utf8;

-- 테이블 데이터 pythondb.tbl_oil:~47 rows (대략적) 내보내기
/*!40000 ALTER TABLE `tbl_oil` DISABLE KEYS */;
INSERT INTO `tbl_oil` (`id`, `area`, `name`, `addr`, `brand`, `tel`, `self`, `gas_p`, `gas`, `gas_l`, `gas_d`) VALUES
	(1, '부산광역시', '은마석유경기장주유소', '부산 강서구 낙동북로 364 (대저1동)', 'GS칼텍스', '051-971-7956', 'Y', '0', 1566, '1368', '0'),
	(2, '부산광역시', '(주)만은에너지 대사리주유소', '부산 강서구 낙동북로 65 (강동동)', 'GS칼텍스', '051-973-5999', 'Y', '0', 1586, '1388', '950'),
	(3, '부산광역시', '은마석유경기장주유소', '부산 강서구 낙동북로 364 (대저1동)', 'GS칼텍스', '051-971-7956', 'Y', '0', 1588, '1368', '0'),
	(4, '부산광역시', '(주)비에스이주유소', '부산광역시 강서구  낙동북로 18 (강동동)', '현대오일뱅크', '051-973-5151', 'Y', '0', 1589, '1389', '0'),
	(5, '부산광역시', '(주)우보주유소', '부산광역시 강서구  낙동북로 142 (강동동)', 'S-OIL', '051-971-9034', 'N', '0', 1598, '1398', '1000'),
	(6, '부산광역시', 'SC(주)국제산업물류단지 주유소', '부산광역시 강서구 생곡로 272', 'GS칼텍스', '051-714-2208', 'Y', '0', 1598, '1398', '950'),
	(7, '부산광역시', '현대주유소', '부산광역시 강서구 낙동북로 209 (대저1동)', 'S-OIL', '051-971-2035', 'N', '0', 1598, '1398', '950'),
	(8, '부산광역시', '평강주유소', '부산 강서구 평강로 183 (대저1동)', '현대오일뱅크', '051-971-4411', 'N', '0', 1598, '1398', '950'),
	(9, '부산광역시', '은마석유(주)구랑주유소', '부산광역시 강서구  가락대로 546 (구랑동)', 'GS칼텍스', '051-972-1571', 'Y', '0', 1598, '1388', '0'),
	(10, '부산광역시', '은마석유(주)신호주유소', '부산광역시 강서구  낙동남로 514 (화전동)', '현대오일뱅크', '051-971-6331', 'Y', '0', 1598, '1408', '980'),
	(11, '부산광역시', '이왕주유소', ' 부산광역시 강서구 대저로255번길 21 (대저1동)', '현대오일뱅크', '051-972-9007', 'N', '0', 1598, '1398', '1000'),
	(12, '부산광역시', '김해공항주유소', '부산광역시 강서구  공항진입로 25 (대저2동)', '현대오일뱅크', '051-973-8291', 'Y', '0', 1599, '1399', '950'),
	(13, '부산광역시', '(주)우양네트웍스 공항주유소', '부산광역시 강서구  공항로 469 (대저2동)', 'S-OIL', '051-941-7237', 'N', '0', 1607, '1397', '0'),
	(14, '부산광역시', '은마석유(주)직영 강서주유소', '부산 강서구 공항로 483 (대저2동)', '현대오일뱅크', '051-973-5104', 'Y', '0', 1608, '1427', '950'),
	(15, '부산광역시', '대양산업(주)대양가덕주유소', '부산 강서구 거가대로 2571.  (천성동)', 'GS칼텍스', '051-715-2201', 'Y', '0', 1608, '1408', '0'),
	(16, '부산광역시', '(주)우양네트웍스 구도일주유소 삼광', '부산 강서구 공항로 799 (대저2동)', 'S-OIL', '051-941-5188', 'Y', '0', 1609, '1399', '900'),
	(17, '부산광역시', '우담주유소', '부산광역시 강서구  낙동남로 127 (송정동)', 'S-OIL', '051-973-5131', 'N', '0', 1615, '1419', '0'),
	(18, '부산광역시', '(주)에스피씨삼립 부산신항주유소', '부산광역시 강서구 가락대로 706 (생곡동)', '현대오일뱅크', '051-941-5189', 'Y', '0', 1615, '1415', '0'),
	(19, '부산광역시', '부산축산농협주유소', '부산 강서구 낙동남로 448 (녹산동)', 'NH-OIL', '051-973-8141', 'N', '0', 1615, '1415', '950'),
	(20, '부산광역시', '제일주유소', '부산광역시 강서구 가락대로 1417', 'GS칼텍스', '051-971-2727', 'N', '0', 1618, '1418', '1000'),
	(21, '부산광역시', '녹산주유소', '부산광역시 강서구 낙동남로 432', '현대오일뱅크', '051-972-9676', 'N', '0', 1618, '1418', '950'),
	(22, '부산광역시', '오봉주유소', '부산 강서구 호계로 1 (죽림동)', 'SK에너지', '051-972-5177', 'N', '0', 1618, '1418', '950'),
	(23, '부산광역시', '금룡주유소', '부산 강서구 가락대로 1361 (봉림동)', 'S-OIL', '051-972-6081', 'N', '0', 1618, '1418', '0'),
	(24, '부산광역시', '신항만주유소', '부산광역시 강서구  가락대로1243번길 68 (봉림동)', '현대오일뱅크', '051-973-0935', 'Y', '0', 1619, '1389', '0'),
	(25, '부산광역시', '녹산주유소', '부산 강서구 낙동남로 700', 'S-OIL', '051-972-1010', 'N', '0', 1628, '1428', '0'),
	(26, '부산광역시', '명지대교주유소', '부산광역시 강서구  르노삼성대로 572 (명지동)', 'GS칼텍스', '051-271-1233', 'Y', '1978', 1628, '1428', '0'),
	(27, '부산광역시', '대양석유(주)한마음주유소', '부산 강서구 르노삼성로 77 (명지동)', 'SK에너지', '051-271-2452', 'Y', '0', 1628, '1428', '0'),
	(28, '부산광역시', '영남셀프주유소', '부산 강서구 공항로 115 (대저2동)', 'GS칼텍스', '051-971-0071', 'Y', '0', 1628, '1428', '980'),
	(29, '부산광역시', '우리들주유소', '부산 강서구 낙동남로 667 (녹산동)', 'GS칼텍스', '051-941-5145', 'N', '0', 1628, '1438', '950'),
	(30, '부산광역시', 'CJ대한통운(주)고려주유소', '부산광역시 강서구  르노삼성대로 586 (명지동)', 'S-OIL', '051-208-5199', 'Y', '0', 1628, '1428', '0'),
	(31, '부산광역시', '(주)DJS신항만물류단지주유소', '부산광역시 강서구 가락대로 834(범방동)', 'S-OIL', '051-831-9208', 'Y', '0', 1628, '1428', '0'),
	(32, '부산광역시', '공항대로주유소', '부산 강서구 공항로 1217 (대저1동)', 'S-OIL', '051-973-8122', 'Y', '0', 1628, '1428', '950'),
	(33, '부산광역시', '유성주유소', '부산광역시 강서구 생곡로 337 (생곡동)', 'S-OIL', '051-973-8852', 'Y', '0', 1628, '1418', '950'),
	(34, '부산광역시', '맥도주유소', '부산 강서구 공항로 381 (대저2동)', 'SK에너지', '051-973-5735', 'Y', '0', 1628, '1428', '980'),
	(35, '부산광역시', '대저고속주유소', '부산광역시 강서구  체육공원로 66 (대저1동)', 'GS칼텍스', '051-941-5151', 'N', '0', 1628, '1373', '950'),
	(36, '부산광역시', '성산주유소', '부산 강서구 생곡로 140 (녹산동)', 'S-OIL', '051-971-5013', 'N', '0', 1628, '1428', '950'),
	(37, '부산광역시', '명품주유소', '부산 강서구 대저로 283 (대저1동)', '현대오일뱅크', '051-941-0052', 'N', '0', 1629, '1429', '1030'),
	(38, '부산광역시', '광신석유(주)직영부산신항주유소', '부산 강서구 르노삼성대로 372 (명지동)', 'SK에너지', '051-271-4405', 'Y', '1920', 1630, '1430', '1000'),
	(39, '부산광역시', '녹산화물터미널주유소', '부산 강서구 녹산산업북로 119 (송정동)', 'GS칼텍스', '051-941-3015', 'N', '0', 1635, '1435', '0'),
	(40, '부산광역시', '(주)범방주유소', '부산광역시 강서구  가락대로 963 (범방동)', 'SK에너지', '051-971-3337', 'N', '0', 1639, '1449', '0'),
	(41, '부산광역시', '씨제이대한통운(주)직영성민주유소', '부산광역시 강서구  가락대로 389 (송정동)', 'S-OIL', '051-832-1611', 'N', '0', 1639, '1429', '0'),
	(42, '부산광역시', '명지주유소', '부산 강서구 낙동남로 1042', 'SK에너지', '051-271-2828', 'N', '0', 1648, '1448', '1000'),
	(43, '부산광역시', '동성셀프주유소', '부산광역시 강서구 명지국제8로 272 (명지동)', 'S-OIL', '051-711-7537', 'Y', '0', 1648, '1438', '0'),
	(44, '부산광역시', '만선주유소', '부산 강서구 가락대로 210번길 102', '현대오일뱅크', '051-831-9171', 'N', '0', 1658, '1448', '0'),
	(45, '부산광역시', '내트럭(주) 부산신항남컨사업소', '부산광역시 강서구 신항남로 507', 'SK에너지', '070-4454-9235', 'N', '0', 1659, '1469', '0'),
	(46, '부산광역시', '(주)소모석유 과학주유소', '부산 강서구 지사과학단지로 291 (지사동)', 'GS칼텍스', '051-973-5153', 'N', '0', 1669, '1478', '980'),
	(47, '부산광역시', 'SK에너지(주)새부산주유소', '부산 강서구 낙동북로 42 (강동동)', 'SK에너지', '051-971-8484', 'N', '0', 1675, '1475', '1000');
/*!40000 ALTER TABLE `tbl_oil` ENABLE KEYS */;

-- 테이블 pythondb.tbl_users 구조 내보내기
CREATE TABLE IF NOT EXISTS `tbl_users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` varchar(50) DEFAULT NULL,
  `upw` varchar(50) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `regdate` timestamp NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `uid` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- 테이블 데이터 pythondb.tbl_users:~1 rows (대략적) 내보내기
/*!40000 ALTER TABLE `tbl_users` DISABLE KEYS */;
INSERT INTO `tbl_users` (`id`, `uid`, `upw`, `name`, `regdate`) VALUES
	(1, 'centum', '1234', '센텀', '2018-11-13 16:37:56');
/*!40000 ALTER TABLE `tbl_users` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
